src/test/resources/preview/apply-discount-to-publication-price.json

{
  "success": true,
  "id": "anId",
  "accountId": "anAccountId",
  "accountNumber": "A0000000",
  "accountName": "anInvoiceOwnerAccountName",
  "invoiceOwnerAccountId": "anAccountId",
  "invoiceOwnerAccountNumber": "A0000000",
  "invoiceOwnerAccountName": "anInvoiceOwnerAccountName",
  "subscriptionNumber": "A-S00000000",
  "version": 5,
  "revision": "5.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2020-12-28",
  "serviceActivationDate": "2020-12-28",
  "customerAcceptanceDate": "2021-01-08",
  "subscriptionStartDate": "2020-12-28",
  "subscriptionEndDate": "2022-01-08",
  "termStartDate": "2020-12-28",
  "termEndDate": "2022-01-08",
  "initialTerm": 376,
  "initialTermPeriodType": "Day",
  "currentTerm": 376,
  "currentTermPeriodType": "Day",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 25.00,
  "totalContractedValue": 300.00,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "aCreatedRequestId__c",
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "10ANNUAL",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "CorporateAccountId__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": "10ANNUAL",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "ratePlans": [
    {
      "id": "aRatePlanId1",
      "lastChangeType": "Add",
      "productId": "aProductId1",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "aProductRatePlanId1",
      "ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated - GW",
      "ratePlanCharges": [
        {
          "id": "ratePlanChargeId1",
          "originalChargeId": "ratePlanChargeId1",
          "productRatePlanChargeId": "aProductRatePlanChargeId1",
          "number": "C-00000000",
          "name": "Delivery-problem credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "USD-5.2",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": -5.200000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2022-01-08",
          "effectiveEndDate": "2022-01-08",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": 0.000000000,
          "dtcv": 0.000000000,
          "description": "",
          "HolidayStart__c": "2021-01-22",
          "HolidayEnd__c": "2021-01-22",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "aRatePlanId2",
      "lastChangeType": "Add",
      "productId": "aProductId1",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "aProductRatePlanId1",
      "ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated - GW",
      "ratePlanCharges": [
        {
          "id": "aRatePlanCharge2",
          "originalChargeId": "aOriginalChargeId2",
          "productRatePlanChargeId": "aProductRatePlanChargeId1",
          "number": "C-00000001",
          "name": "Delivery-problem credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "USD-5.2",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": -5.200000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2022-01-08",
          "effectiveEndDate": "2022-01-08",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": 0.000000000,
          "dtcv": 0.000000000,
          "description": "",
          "HolidayStart__c": "2021-01-15",
          "HolidayEnd__c": "2021-01-15",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "aRatePlanId3",
      "lastChangeType": "Add",
      "productId": "aProductId1",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "aProductRatePlanId1",
      "ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated - GW",
      "ratePlanCharges": [
        {
          "id": "aRatePlanCharges3",
          "originalChargeId": "anOriginalChargeId3",
          "productRatePlanChargeId": "aProductRatePlanChargeId1",
          "number": "C-00000003",
          "name": "Delivery-problem credit",
          "type": "OneTime",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "USD-5.2",
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": -5.200000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": null,
          "listPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": null,
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2022-01-08",
          "effectiveEndDate": "2022-01-08",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": 0.000000000,
          "dtcv": 0.000000000,
          "description": "",
          "HolidayStart__c": "2021-01-08",
          "HolidayEnd__c": "2021-01-08",
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "aRatePlanId4",
      "productId": "aProductId1",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "aProductRatePlanId4",
      "ratePlanName": "Percentage",
      "ratePlanCharges": [
        {
          "id": "aRatePlanChargeId4",
          "originalChargeId": "anOriginalChargeId4",
          "productRatePlanChargeId": "aProductRatePlanChargeId4",
          "number": "C-00000004",
          "name": "Percentage",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 2,
          "pricingSummary": "10%  discount",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": null,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": 10.000000000,
          "discountAmount": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2021-01-08",
          "effectiveEndDate": "2022-01-08",
          "processedThroughDate": "2021-01-08",
          "chargedThroughDate": "2021-02-08",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 12,
          "specificEndDate": null,
          "mrr": 0.000000000,
          "dmrc": 0.000000000,
          "tcv": 0.000000000,
          "dtcv": 0.000000000,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "aRatePlanId5",
      "productId": "2c92a0ff6619bf8901661aa3247c4b1d",
      "productName": "Guardian Weekly - Domestic",
      "productSku": "ABC-00000029",
      "productRatePlanId": "aProductRatePlanId5",
      "ratePlanName": "GW Oct 18 - Annual - Domestic",
      "ratePlanCharges": [
        {
          "id": "aRatePlanChargeId5",
          "originalChargeId": "anOriginalChargeId5",
          "productRatePlanChargeId": "aProductRatePlanChargeId5",
          "number": "C-00000005",
          "name": "GW Oct 18 - Annual - Domestic",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 2,
          "pricingSummary": "USD300",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "USD",
          "price": 300.000000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2021-01-08",
          "effectiveEndDate": "2022-01-08",
          "processedThroughDate": "2021-01-08",
          "chargedThroughDate": "2022-01-08",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 25.000000000,
          "dmrc": 0.000000000,
          "tcv": 300.000000000,
          "dtcv": 8.870967750,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": []
    }
  ]
}